# Data Science Salaries

### Objective
To find the best location to work as a Data Scientist.

With this information, one can guide their career by selecting companies in these locations whose values align with theirs.

#### Bonus Objectives
- To understand how FAANG + Microsoft differs from the pack
- To understand disparities and what is the most one can make of, given equal opportunity


### Table of Contents:

- Section 1: Data Science Salaries
- Section 2: Cost of Living Index
- Section 3: Combining Data Science Salaries with Cost of Living

In [1]:
# Import libraries
import numpy as np
import pandas as pd

# Section 1: Data Science Salaries

First, we read the salary data into a Data Frame and perform a basic sense check the available data

In [2]:
# Read STEM Salaries
sdf = pd.read_csv('/kaggle/input/data-science-and-stem-salaries/Levels_Fyi_Salary_Data.csv')
print(sdf.shape)

(62642, 29)

In [3]:
sdf.describe()

,totalyearlycompensation,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,cityid,dmaid,rowNumber,Masters_Degree,Bachelors_Degree,Doctorate_Degree,Highschool,Some_College,Race_Asian,Race_White,Race_Two_Or_More,Race_Black,Race_Hispanic
count,6.264200e+04,62642.000000,62642.000000,6.264200e+04,6.264200e+04,62642.000000,62642.000000,62640.000000,62642.000000,62642.000000,62642.000000,62642.000000,62642.000000,62642.000000,62642.000000,62642.000000,62642.000000,62642.000000,62642.000000
mean,2.163004e+05,7.204135,2.702093,1.366873e+05,5.148608e+04,19334.746588,9856.201989,616.097222,41694.723732,0.245698,0.201223,0.028783,0.005108,0.005667,0.187925,0.128221,0.012835,0.011015,0.018039
std,1.380337e+05,5.840375,3.263656,6.136928e+04,8.187457e+04,26781.292040,6679.104563,289.843390,24488.865879,0.430504,0.400917,0.167196,0.071291,0.075067,0.390655,0.334338,0.112562,0.104373,0.133094
min,1.000000e+04,0.000000,0.000000,0.000000e+00,0.000000e+00,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,1.350000e+05,3.000000,0.000000,1.080000e+05,0.000000e+00,1000.000000,7369.000000,506.000000,20069.250000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,1.880000e+05,6.000000,2.000000,1.400000e+05,2.500000e+04,14000.000000,7839.000000,807.000000,42019.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,2.640000e+05,10.000000,4.000000,1.700000e+05,6.500000e+04,26000.000000,11521.000000,807.000000,63021.750000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,4.980000e+06,69.000000,69.000000,1.659870e+06,2.800000e+06,1000000.000000,47926.000000,881.000000,83875.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [4]:
# Check the data
sdf.head(5)

,timestamp,company,level,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,tag,basesalary,...,Doctorate_Degree,Highschool,Some_College,Race_Asian,Race_White,Race_Two_Or_More,Race_Black,Race_Hispanic,Race,Education
0,6/7/2017 11:33:27,Oracle,L3,Product Manager,127000,"Redwood City, CA",1.5,1.5,NaN,107000.0,...,0,0,0,0,0,0,0,0,NaN,NaN
1,6/10/2017 17:11:29,eBay,SE 2,Software Engineer,100000,"San Francisco, CA",5.0,3.0,NaN,0.0,...,0,0,0,0,0,0,0,0,NaN,NaN
2,6/11/2017 14:53:57,Amazon,L7,Product Manager,310000,"Seattle, WA",8.0,0.0,NaN,155000.0,...,0,0,0,0,0,0,0,0,NaN,NaN
3,6/17/2017 0:23:14,Apple,M1,Software Engineering Manager,372000,"Sunnyvale, CA",7.0,5.0,NaN,157000.0,...,0,0,0,0,0,0,0,0,NaN,NaN
4,6/20/2017 10:58:51,Microsoft,60,Software Engineer,157000,"Mountain View, CA",5.0,3.0,NaN,0.0,...,0,0,0,0,0,0,0,0,NaN,NaN

### Location data

Location information can be improved by splitting them into their own columns, for City, State and Country

In [5]:
# Check location data
sdf.location.value_counts()

Seattle, WA                      8701
San Francisco, CA                6797
New York, NY                     4562
Redmond, WA                      2649
Mountain View, CA                2275
                                 ...
San Fernando, LB, Philippines       1
Suwanee, GA                         1
Oxford, MS                          1
Wayne, PA                           1
Hilbert, WI                         1
Name: location, Length: 1050, dtype: int64

It looks like not all locations are US-specific.

In [6]:
# Create a city ID so that we can use as a lookup
sdf[['city','state','country']] = sdf.location.str.split(", ",expand=True,n=2)
sdf.country.fillna('United States',inplace=True)
sdf['city_id'] = sdf.agg(lambda df: f"{df['city']}_{df['country']}",axis = 1)

sdf.head(5)

,timestamp,company,level,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,tag,basesalary,...,Race_White,Race_Two_Or_More,Race_Black,Race_Hispanic,Race,Education,city,state,country,city_id
0,6/7/2017 11:33:27,Oracle,L3,Product Manager,127000,"Redwood City, CA",1.5,1.5,NaN,107000.0,...,0,0,0,0,NaN,NaN,Redwood City,CA,United States,Redwood City_United States
1,6/10/2017 17:11:29,eBay,SE 2,Software Engineer,100000,"San Francisco, CA",5.0,3.0,NaN,0.0,...,0,0,0,0,NaN,NaN,San Francisco,CA,United States,San Francisco_United States
2,6/11/2017 14:53:57,Amazon,L7,Product Manager,310000,"Seattle, WA",8.0,0.0,NaN,155000.0,...,0,0,0,0,NaN,NaN,Seattle,WA,United States,Seattle_United States
3,6/17/2017 0:23:14,Apple,M1,Software Engineering Manager,372000,"Sunnyvale, CA",7.0,5.0,NaN,157000.0,...,0,0,0,0,NaN,NaN,Sunnyvale,CA,United States,Sunnyvale_United States
4,6/20/2017 10:58:51,Microsoft,60,Software Engineer,157000,"Mountain View, CA",5.0,3.0,NaN,0.0,...,0,0,0,0,NaN,NaN,Mountain View,CA,United States,Mountain View_United States

For this experiment, we will remove FAANG and Microsoft data, as they are some industry heavyweights that may skew the overall data. We can explore this excluded data later.

In [7]:
faangless_sdf = sdf.copy()

faang_list = ['Facebook','Apple','Amazon','Netflix','Google','Microsoft']
faang_list = '|'.join(faang_list)

faangless_s = faangless_sdf.company.str.contains(faang_list,case=False)

fdf = faangless_sdf = faangless_sdf[faangless_s == False]

print('Original data size  : ' , sdf.shape)
print('FAANG-less data size: ' , fdf.shape)
print(sdf.shape[0] - fdf.shape[0], 'rows removed')
print(round((fdf.shape[0] / sdf.shape[0])*100,1) , '% remaining')

Original data size  :  (62642, 33)
FAANG-less data size:  (39455, 33)
23187 rows removed
63.0 % remaining

Next, we filter for job titles with the words "data" in them. This could range from Data Scientists, Engineers to Analysts.

In [8]:
# Filter for all Data-related job titles only

fds = fdf[fdf.title.str.contains('data',case=False)]

print(fds.shape)
fds.head()

(1711, 33)

,timestamp,company,level,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,tag,basesalary,...,Race_White,Race_Two_Or_More,Race_Black,Race_Hispanic,Race,Education,city,state,country,city_id
419,6/5/2018 14:06:30,LinkedIn,Senior,Data Scientist,233000,"San Francisco, CA",4.0,0.0,Data Analysis,162000.0,...,0,0,0,0,NaN,NaN,San Francisco,CA,United States,San Francisco_United States
444,6/8/2018 17:55:09,ebay,26,Data Scientist,180000,"San Jose, CA",10.0,5.0,NaN,0.0,...,0,0,0,0,NaN,NaN,San Jose,CA,United States,San Jose_United States
454,6/10/2018 19:39:35,Twitter,Staff,Data Scientist,500000,"San Francisco, CA",4.0,4.0,ML / AI,200000.0,...,0,0,0,0,NaN,NaN,San Francisco,CA,United States,San Francisco_United States
523,6/25/2018 8:45:29,Tesla,Senior Engineer,Data Scientist,168000,"Palo Alto, CA",8.0,3.0,Mechanical Engineering,118000.0,...,0,0,0,0,NaN,NaN,Palo Alto,CA,United States,Palo Alto_United States
535,6/26/2018 21:37:46,GrubHub,II,Data Scientist,187000,"New York, NY",4.0,1.0,ML / AI,150000.0,...,0,0,0,0,NaN,NaN,New York,NY,United States,New York_United States

In [9]:
fds.title.value_counts()

Data Scientist    1711
Name: title, dtype: int64

It appears only Data Scientists are available in the job titles. This is great!

# Section 2: Cost of Living Index

Next, we read the cost of living index by city dataset into a dataframe and rename columns for easy consumption.

In [10]:
# Read the Cost of Living Index data
cdf = pd.read_csv('/kaggle/input/cost-of-living-index-by-city-2022/costofliving.csv')

# Rename columns
cdf.rename(columns = {
    'Rent Index':'rent', 
    'Cost of Living Index':'coli',
    'Cost of Living Plus Rent Index':'colri',
    'Groceries Index':'groceries',
    'Restaurant Price Index':'restaurants',
    'Local Purchasing Power Index':'lppi'}
          , inplace = True)

In [11]:
# Check the data
cdf.head(15)

,Rank,City,coli,rent,colri,groceries,restaurants,lppi
0,NaN,"Hamilton, Bermuda",149.02,96.10,124.22,157.89,155.22,79.43
1,NaN,"Zurich, Switzerland",131.24,69.26,102.19,136.14,132.52,129.79
2,NaN,"Basel, Switzerland",130.93,49.38,92.70,137.07,130.95,111.53
3,NaN,"Zug, Switzerland",128.13,72.12,101.87,132.61,130.93,143.40
4,NaN,"Lugano, Switzerland",123.99,44.99,86.96,129.17,119.80,111.96
5,NaN,"Lausanne, Switzerland",122.03,59.55,92.74,122.56,127.01,127.01
6,NaN,"Beirut, Lebanon",120.47,27.76,77.01,141.33,116.95,15.40
7,NaN,"Bern, Switzerland",118.16,46.12,84.39,118.37,120.88,112.46
8,NaN,"Geneva, Switzerland",114.05,75.05,95.77,112.70,126.31,120.60
9,NaN,"Stavanger, Norway",104.61,35.38,72.16,102.46,107.51,85.90
10,NaN,"Honolulu, HI, United States",103.65,65.07,85.56,114.92,94.28,89.24
11,NaN,"Oslo, Norway",102.33,46.39,76.11,97.62,111.54,85.18
12,NaN,"Bergen, Norway",100.38,34.84,69.66,96.22,103.51,86.96
13,NaN,"New York, NY, United States",100.00,100.00,100.00,100.00,100.00,100.00
14,NaN,"Trondheim, Norway",99.43,37.74,70.52,95.11,103.21,88.00

Just like before, we should create separate columns for city, state and country, which also ends up being our city_id index for matching against the dataframes in Section 1

In [12]:
cdf[['city','state_','country_']] = cdf.City.str.split(", ",expand=True,n=2)

mask = cdf['state_'].str.len() > 2
cdf['state'] = np.where(mask, None, cdf['state_'])
cdf['country'] = np.where(mask, cdf['state_'], cdf['country_'])

cdf.drop(['Rank','City','state_','country_'], axis=1, inplace=True)
cdf['city_id'] = cdf.agg(lambda df: f"{df['city']}_{df['country']}",axis = 1)

cdf.set_index('city_id', inplace = True)

cdf.head(15)

,coli,rent,colri,groceries,restaurants,lppi,city,state,country
city_id,,,,,,,,,
Hamilton_Bermuda,149.02,96.10,124.22,157.89,155.22,79.43,Hamilton,None,Bermuda
Zurich_Switzerland,131.24,69.26,102.19,136.14,132.52,129.79,Zurich,None,Switzerland
Basel_Switzerland,130.93,49.38,92.70,137.07,130.95,111.53,Basel,None,Switzerland
Zug_Switzerland,128.13,72.12,101.87,132.61,130.93,143.40,Zug,None,Switzerland
Lugano_Switzerland,123.99,44.99,86.96,129.17,119.80,111.96,Lugano,None,Switzerland
Lausanne_Switzerland,122.03,59.55,92.74,122.56,127.01,127.01,Lausanne,None,Switzerland
Beirut_Lebanon,120.47,27.76,77.01,141.33,116.95,15.40,Beirut,None,Lebanon
Bern_Switzerland,118.16,46.12,84.39,118.37,120.88,112.46,Bern,None,Switzerland
Geneva_Switzerland,114.05,75.05,95.77,112.70,126.31,120.60,Geneva,None,Switzerland
Stavanger_Norway,104.61,35.38,72.16,102.46,107.51,85.90,Stavanger,None,Norway
Honolulu_United States,103.65,65.07,85.56,114.92,94.28,89.24,Honolulu,HI,United States
Oslo_Norway,102.33,46.39,76.11,97.62,111.54,85.18,Oslo,None,Norway
Bergen_Norway,100.38,34.84,69.66,96.22,103.51,86.96,Bergen,None,Norway
New York_United States,100.00,100.00,100.00,100.00,100.00,100.00,New York,NY,United States
Trondheim_Norway,99.43,37.74,70.52,95.11,103.21,88.00,Trondheim,None,Norway

Good! Now we have everything we need to combine the two data sets.

# Section 3: Combining Data Science Salaries with Cost of Living

Since we need to know which cities are the best, we should use `city_id` as the index, and thus do a "`cdf` left join `fds` on `city_id` "